NextFOAM-2501/tutorials/lagrangian/reactingParcelFoam/splashPanel/0.orig/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.21;

boundaryField
{
    sides
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
